import {
  PricingPlanFree,
  PricingPlanPersonal,
  PricingPlanCompany,
  PricingPlanOrganization,
  PricingCompanySvg,
  PricingIndustrySvg,
  PricingNetworkSvg,
  PricingPersonSvg,
  PricingSearchSvg,
} from 'assets/icons'
import { FeatureItem } from 'containers/pricing/interface'
import { WEB } from '../routes/web'
import type { PlanItem, FAQItemsType, PricingFeatureItems } from './interface'

export const FAQItems: FAQItemsType = {
  pricing: [
    {
      answer: 'آیا امکان صدور پیش فاکتور و فاکتور رسمی وجود دارد؟',
      question:
        'بله، شما می‌توانید از طریق سامانه و یا تماس با واحد فروش و بازاریابی ما، درخواست صدور پیش فاکتور/فاکتور رسمی نمایید. فاکتورهای رسمی اول یا پانزدهم هر ماه صادر و برای مشتریان ارسال می‌گردد.',
    },
    {
      answer: 'اشتراک ماهانه هم وجود دارد؟',
      question: 'خیر، اشتراک‌های رسمیو به صورت سالانه ارائه می‌شوند.',
    },
    {
      answer: 'برای خرید اشتراک‌ها نیاز به بستن قرارداد است؟',
      question: 'خیر. الزامی به عقد قرارداد نیست اما در صورت نیاز تماس بگیرید.',
    },
    {
      answer: 'منظور از محدودیت تعداد بازدید صفحه شرکت چیست؟',
      question:
        'در هر اشتراک کاربران می توانند تمام اجزا و اطلاعات(به جز بخش های تحلیلی) تعداد مشخصی از صفحات شرکت را به صورت کامل مشاهده نمایند. پس از پایان میزان مجاز محدودیت، نیاز است اشتراک بالاتر خریداری شود. این محدودیت به صورت سالانه برای کاربران اشتراک رایگان ۲۴صفحه، کاربران اشتراک شخصی ۱۰۰۰ صفحه و برای کاربران اشتراک شرکتی و سازمانی به صورت نامحدود است.',
    },
    {
      answer: 'محدودیت تعداد کاربر و زیرمجموعه هر اشتراک به چه صورت است؟',
      question:
        'اشتراک‌های رایگان و شخصی مخصوص یک کاربر طراحی شده‌اند. کاربر می‌تواند اکانت خود را روی یک دستگاه موبایل و یک کامپیوتر استفاده کند. در صورتی که یک شرکت نیاز به استفاده بیش از یک کاربر دارد می‌تواند از اشتراک شرکتی استفاده نماید. با این کار دسترسی شما به ابزارهای بیشتری مانند گراف ارتباطی نیز فراهم می‌شود. در اشتراک شرکتی نهایتا تا ۵ کاربر می‌توانند از یک اشتراک استفاده نمایند. در صورتی که به تعداد کاربر بیشتری نیاز دارید می‌توانید از اشتراک سازمانی استفاده کنید.',
    },

    {
      answer: 'آیا پس از خرید اشتراک می‌توان آن را ارتقا داد؟',
      question:
        'بله. وارد قسمت خرید اشتراک‌ھا بشوید و اشتراک مورد نظرتان را انتخاب کنید، رسمیو ما‌به‌التفاوت پرداختی شما را محاسبه می‌کند و به شما اعلام می‌کند که با پرداخت آن مبلغ می‌توانید از اشتراک بالاتر برخوردار شوید.',
    },
    {
      answer:
        'در صورت عدم تمدید اشتراک چه اتفاقی برای داده های کاربر رخ خواهد داد؟',
      question:
        'در صورت عدم تمدید اشتراک( تمدید اشتراک فعلی یا ارتقا به اشتراک بالاتر) در موعد زمانی مقرر، دسترسی کاربر به حساب کاربری و اطلاعات و داده های(گراف ها، لیست ها، جستجوها و…) ذخیره شده مسدود خواهد شد.',
    },
    {
      answer:
        'در صورت وجود مشکل و یا سوال چه راه های ارتباطی برای تماس با رسمیو وجود دارد؟',
      question:
        'شما می‌توانید از راه ارسال ایمیل، تماس تلفنی، صفحه تماس با ما و نیز آیکون چت سمت چپ صفحه، با ما در ارتباط باشید. برای اشتراک‌های سازمانی داخلی خاص در نظر گرفته می‌شود.',
    },
    {
      answer: 'آیا می‌توان مشابه خدمات رسمیو را از مجموعه دیگری دریافت کرد؟',
      question:
        'در حال حاضر خیر. در صورتی که برای خرید از رسمیو نیاز به استعلام قیمت از شرکت‌های مشابه دارید باید بدانید که تاکنون به دلیل پیچیدگی‌های فنی شرکتی قادر به ارایه خدمات مشابه رسمیو نبوده است.',
    },
  ],

  graph: [
    {
      answer: 'چطور شبکه‌ارتباطات را ذخیره کنیم؟',
      question:
        'پس از ساخت یک شبکه ارتباطات می‌توانید آن را ذخیره کنید و از آن به بعد می‌توانید اطلاعات ذخیره خود را در داشبورد در دسترس داشته باشید.',
    },
    {
      answer: 'شبکه‌ارتباطات چه اطلاعاتی را نمایش می‌دهد؟',
      question:
        'یک فرد یا شرکت را انتخاب می‌کنید و ارتباط مدیریتی آن را چه فرد چه شخص گسترش دهید تا یک نمودار از ارتباط برای خود بسازید.',
    },
    {
      answer: 'آیا امکان دریافت خروجی از شبکه‌ارتباطات وجود دارد؟',
      question:
        'می‌توانید در هر زمان از شبکه‌ارتباطات شرکت‌ها خروجی PDF دریافت کنید.',
    },
    {
      answer: 'برای دسترسی به شبکه ارتباطات چه اشتراکی از رسمیو نیاز است؟',
      question: 'برای دسترسی به شبکه ارتباطات چه اشتراکی از رسمیو نیاز است؟',
    },
    {
      answer: 'چگونه ارتباطات کشف می‌‌شوند؟',
      question:
        'هرگاه یک شخص حقوقی عضو هیات مدیره یک شرکت دیگر باشد. ارتباط شرکت مادر برقرار می‌شود. تعریف زیر مجموعه نیز برعکس همین تعریف است.',
    },
  ],

  'advanced-search': [
    {
      answer: 'آیا دریافت خروجی اکسل و ذخیره جستجو پیشرفته امکان‌پذیر است؟',
      question:
        'بله، شما می‌توانید نتایج جستجو پیشرفته خود را ذخیره کنید و یا از آن‌ها خروجی اکسل دریافت کنید.',
    },
    {
      answer: 'آیا فیلتر شرکت‌هایی با شماره تماس ممکن است؟',
      question: 'بله، در جستجوی پیشرفته فیلتر دارای شماره تماس را فعال کنید.',
    },
    {
      answer: 'چه فیلترهایی برای جستجوی پیشرفته داریم؟',
      question:
        'مجوزهای تولید، سرمایه ثبتی، اطلاعات ثبتی و تماس، مجوزها و صنعت‌ها، هیئت‌مدیره و کارمندان، اطلاعات مالی، اطلاعات جغرافیایی',
    },
    {
      answer: 'در چه دسته‌هایی می‌توانیم جستجوی پیشرفته داشته باشیم؟',
      question:
        'در حال حاضر در دسته‌های شرکت، شخص، صنعت، محصول، آگهی رسمی، مالکیت فکری',
    },
  ],

  ads: [
    {
      answer: 'چه صفحاتی و در چه شرایطی نمایش داده می‌شود؟',
      question:
        'ما برای ۲ میلیون شرکت رسمی در ایران و بیش از ۳ میلیون فرد در شرکت‌ها پروفایل‌هایی اختصاصی ساخته‌ایم. تبلیغات شما در این مکان‌ها نمایش داده می‌شود و امکان مشاهده تبلیغ شما در این ۵ میلیون صفحه وجود دارد. ۹۸ درصد از کاربران رسمیو که عددی حدود روزانه ۱۰۰ هزار نفر هستند امکان دیدن این تبلیغات را دارند.',
    },
    { answer: 'امکان رزرو چند جایگاه با هم وجود دارد؟', question: 'بله.' },
    {
      answer: 'آمار بازدید چگونه است؟',
      question:
        'آمار بازدید رسمیو به صورت کلی رو به افزایش است. اما در ماه آبان ۱۴۰۱ آمار بازدید از صفحات دارای تبلیغ ۱۰۰ هزار بار در روز است. اما آمار کلیک روی تبلیغات شما به جذابیت و کارآمدی تبلیغ شما بستگی دارد.',
    },
    {
      answer: 'بک لینک تبلیغات در رسمیو فالو هستند؟',
      question:
        'در حالت عادی خیر، در صورت نیاز می‌توانید لینک‌های فالو را با قیمت توافقی دریافت کنید.',
    },
    {
      answer:
        'من فایل تبلیغ آماده را ندارم، شما می‌توانید برای من تبلیغ را آماده کنید؟',
      question: 'بله با واحد فروش تماس بگیرید.',
    },
  ],

  persons: [
    {
      answer: 'منظور از افراد در شرکت، چه سمت‌هایی هستند؟',
      question:
        'کلیه افرادی که تا به امروز در یکی از شرکت‌ها دارای سمت ثبتی شامل، مدیر عامل، اعضای و رییس هیات مدیره و بازرس یا عضو علی البدل بوده‌اند.',
    },
    {
      answer: 'تاریخ ورود و خروج افراد به درستی نمایش داده می‌شود؟',
      question:
        ' تاریخ‌های ورود افراد به درستی ثبت شده است. تاریخ‌های خروج که دقیقا در آگهی‌ها ذکر شده باشد نیز به دقت ثبت شده است. اما در مواردی که پیش از اتمام دوره مسئولیت شخص با شخص دیگر جایگزین شده باشد ممکن است داده تاریخ خروج ناقص یا بعضا اشتباه باشد. تا به امروز با توجه به ساختار انتشار داده‌ها در روزنامه رسمی در سال‌های مختلف امکان دقت صد‌درصدی در تاریخ ورود و خروج وجود ندارد برای کلیه اشخاص و کلیه سال‌ها وجود ندارد.',
    },
    {
      answer:
        'اگر شخصی نماینده یک شرکت حقوقی در هیات مدیره باشد در اطلاعات ذکر می‌شود؟',
      question:
        'بله، شرکتی که عضو هیات مدیره است. شرکت مادر و نماینده به عنوان نماینده شرکت ذکر می‌شود.',
    },
    {
      answer: 'منبع اطلاعات چیست؟',
      question:
        'با ورود به صفحه منابع اطلاعات می‌توانید از پایگاه داده‌هایی که رسمیو آن‌ها را بازخوانی و بازنشر می‌کند اطلاع کسب کنید.',
    },
    {
      answer: 'چه نوعی از اطلاعات در صفحه افراد وجود دارد؟',
      question:
        'نام و نام‌خانوادگی، شماره ملی، در بعضی موارد تاریخ تولد، شماره تماس، اطلاعات ایمیل، بیوگرافی. در صورتی که نیاز دارید اطلاعات شما تکمیل شود با پشتیبانی رسمیو تماس بگیرید.',
    },
    {
      answer: 'آیا سابقه فعالیت اشخاص در شرکت‌ها وجود دارد؟',
      question:
        'در صورتی که نام فردی در یکی از روزنامه‌های رسمی منتشر شده در کشور منتشر شده باشد در رسمیو قابل دسترسی است.',
    },
  ],

  companies: [
    {
      answer: 'منبع اطلاعات چیست؟',
      question:
        'با ورود به صفحه منابع اطلاعات می‌توانید از پایگاه داده‌هایی که رسمیو آن‌ها را بازخوانی و بازنشر می‌کند اطلاع کسب کنید.',
    },
    {
      answer: 'اطلاعات تماس شرکت تا چقدر صحیح است؟',
      question:
        'این شماره‌های تماس از راه‌های مختلفی جمع‌آوری شده است و کاربر باید خود از صحت و دقت اطلاعات تماس منتشر شده توسط شرکت‌ها اطمینان حاصل نماید.',
    },
    {
      answer: 'آیا سهامداران شرکت‌های سهامی خاص نمایش داده می‌شود؟',
      question: 'خیر، این اطلاعات جزو اطلاع منتشر شده به صورت باز و رسمی نیست.',
    },
    {
      answer: 'اساسنامه شرکت‌ها در رسمیو وجود دارد؟',
      question:
        'خیر، این اطلاعات توسط پایگاهی منتشر نمی‌شود. اگر تمایل دارید اطلاعات اساسنامه خود را در پروفایل شرکت خود در رسمیو به نمایش بگذارید با ما تماس بگیرید.',
    },
    {
      answer: 'چطور شرکت ها را اعتبارسنجی کنیم؟',
      question:
        'با جستجوی نام یا شماره ملی شرکتی در رسمیو می‌توانید از اطلاعات رسمی و ثبتی منتشر شده توسط آن شرکت اطلاع پیدا کنید. کلیه شرکت‌های موجود در رسمیو قانونی و ثبت شده هستند.',
    },
  ],

  industry: [
    {
      answer: 'اطلاعات تا چه حد به روز است؟',
      question:
        'بعد از بروزرسانی هر پایگاه داده اطلاع آن در صفحه منابع داده به روز می‌شود. می‌توانید از آن‌جا بروز بودن اطلاعات را بررسی کنید.',
    },
    { answer: 'اطلاعات صادرات وجود دارد؟', question: 'بله' },
    {
      answer:
        'ارتباط بین کالاها و شرکت‌های واردکننده یا تولیدکننده در ایران وجود دارد؟',
      question:
        'در صورت وجود و انتشار اطلاعات بله. با این‌حال در خصوص هر HS کد توسط کاربر این بررسی صورت گیرد.',
    },
  ],
  api: [
    {
      answer: 'آیا امکان دریافت نسخه تست ,وجود دارد؟',
      question: 'بله، با پشتیبانی تماس بگیرید.',
    },
    {
      answer: 'آیا برای استفاده از وب سرویس نیازی به خرید اشتراک است؟',
      question: 'خیر',
    },
    {
      answer: 'برای شرکت‌های کوچک و دانش بنیان تسهیلاتی دارید؟',
      question: 'بله، با پشتیبانی تماس بگیرید.',
    },
  ],
}

export const plansData: PlanItem[] = [
  {
    svg: <PricingPlanFree viewBox='0 0 28 28' />,
    title: 'free',
    description: 'برای شروع کار با رسمیو',
    price: ['همیشه رایگان'],
    yearly: false,
    step: 0,
    btnText: 'رایگان امتحان کنید',
    preFactor: false,
    attributes: ['هر چیزی که برای آشنایی با امکانات رسمیو نیاز دارید'],
    customers: [],
    link: '',
    isEnabled: true,
    isUpgrade: false,
    isExtend: false,
    validUntil: '',
    id: 0,
  },
  {
    svg: <PricingPlanPersonal viewBox='0 0 28 28' />,
    title: 'personal',
    description: 'برای حسابدارها، وکلا، پژوهشگرا، تحلیلگران مالی',
    price: ['1 میلیون تومان'],
    pricing: [
      {
        price: 10000000,
        originalPrice: 10000000,
        numberOfUser: 1,
      },
    ],
    yearly: true,
    step: 0,
    btnText: 'خرید اشتراک',
    preFactor: true,
    attributes: [
      'جستجو بین همه شرکت‌ها و افراد',
      '۱۰۰۰ بار نمایش اطلاعات شرکت‌ها',
      'دنبال کردن تغییرات شرکت‌ها',
    ],
    customers: [],
    link: `${WEB.CHECKOUT}/?plan=11`,
    isEnabled: true,
    isUpgrade: false,
    isExtend: false,
    validUntil: '',
    id: 11,
  },
  {
    svg: <PricingPlanCompany viewBox='0 0 28 28' />,
    title: 'pricing.company',
    description:
      'برای شرکت‌های دولتی و خصوصی، کارخانه‌های تولیدی، شرکت‌های بازاریابی و…',
    price: [
      '10 میلیون تومان',
      '18 میلیون تومان',
      '24 میلیون تومان',
      '28 میلیون تومان',
      '30 میلیون تومان',
    ],
    pricing: [
      {
        price: 100000000,
        originalPrice: 100000000,
        numberOfUser: 1,
      },
      {
        price: 180000000,
        originalPrice: 200000000,
        numberOfUser: 2,
      },
      {
        price: 240000000,
        originalPrice: 300000000,
        numberOfUser: 3,
      },
      {
        price: 280000000,
        originalPrice: 400000000,
        numberOfUser: 4,
      },
      {
        price: 300000000,
        originalPrice: 500000000,
        numberOfUser: 5,
      },
    ],
    yearly: true,
    users: [1, 5],
    step: 1,
    btnText: 'خرید اشتراک',
    preFactor: true,
    attributes: [
      'استفاده نامحدود از رسمیو',
      'دسترسی به اطلاعات تحلیلی',
      'جستجوی پیشرفته و فیلتر اطلاعات',
      'ابزار شبکه ارتباطات و تحلیل صنعت',
    ],
    customers: [
      { customerName: 'bahman', url: '/svg/pricing/bahman.png' },
      { customerName: 'top', url: '/svg/pricing/top.png' },
      { customerName: 'zarif', url: '/svg/pricing/zarif.png' },
    ],
    link: `${WEB.CHECKOUT}/?plan=12`,
    isEnabled: true,
    isUpgrade: false,
    isExtend: false,
    validUntil: '',
    id: 12,
  },
  {
    svg: <PricingPlanOrganization viewBox='0 0 28 28' />,
    title: 'organization',
    description:
      'برای سازما‌ن‌ها و شرکت‌های بزرگ مانند بانک‌ها، بازرگانی‌ها و شرکت‌های سرمایه‌گذاری، نهادهای نظارتی و…',
    price: [
      '50 میلیون تومان',
      '90 میلیون تومان',
      '120 میلیون تومان',
      '140 میلیون تومان',
      '300 میلیون تومان',
    ],
    pricing: [
      {
        price: 500000000,
        originalPrice: 500000000,
        numberOfUser: 10,
      },
      {
        price: 900000000,
        originalPrice: 1000000000,
        numberOfUser: 20,
      },
      {
        price: 1200000000,
        originalPrice: 1500000000,
        numberOfUser: 30,
      },
      {
        price: 1400000000,
        originalPrice: 2000000000,
        numberOfUser: 40,
      },
      {
        price: 3000000000,
        originalPrice: 1,
        numberOfUser: 50,
      },
    ],
    yearly: true,
    users: [10, 50],
    step: 10,
    btnText: 'خرید اشتراک',
    preFactor: true,
    attributes: [
      'خط اختصاصی پشتیبانی',
      'دسترسی از طریق IP Range',
      'آموزش ویژه و اختصاصی',
      'دسترسی سازمانی با بی‌نهایت کاربر',
    ],
    customers: [
      { customerName: 'ati', url: '/svg/pricing/ati.png' },
      { customerName: 'boors', url: '/svg/pricing/boors.png' },
      { customerName: 'sasol', url: '/svg/pricing/sasol.png' },
    ],
    link: `${WEB.CHECKOUT}/?plan=13`,
    isEnabled: true,
    isUpgrade: false,
    isExtend: false,
    validUntil: '',
    id: 13,
  },
]

export const pricingFeaturesItems = [
  'free',
  'personal',
  'pricing.company',
  'organization',
]

export const featuresSimpleData = [
  {
    title: {
      text: 'تعداد بازدید صفحه شرکت/ شخص',
      content:
        'تعداد مجاز مشاهده سالیانه پروفایل/صفحه شرکت های مختلف توسط یک کاربر در هر اشتراک',
    },
    data: [
      {
        simpleDataId: 15768285,
        text: 'محدود',
        content: '24 پروفایل/صفحه شرکت های مختلف در سال',
        status: false,
      },
      {
        simpleDataId: 15768287,
        text: 'محدود',
        content: '1000 پروفایل/صفحه شرکت های مختلف در سال',
        status: false,
      },
      {
        simpleDataId: 15768289,
        text: 'نامحدود',
        content: '',
        status: true,
      },
      {
        simpleDataId: 15768290,
        text: 'نامحدود',
        content: '',
        status: true,
      },
    ],
  },
  {
    title: {
      text: 'تعداد کاربر',
      content: 'تعداد حساب های کاربری/زیرمجموعه تعریف شده در هر اشتراک',
    },
    data: [
      {
        simpleDataId: 15768292,
        text: '1 کاربر',
        content: '',
        status: false,
      },
      {
        simpleDataId: 15768294,
        text: '1 کاربر',
        content: '',
        status: false,
      },
      {
        simpleDataId: 157682896,
        text: 'تا 5 کاربر',
        content: '',
        status: false,
      },
      {
        simpleDataId: 157682898,
        text: 'نامحدود',
        content: '',
        status: true,
      },
    ],
  },
]

export const featuresData: FeatureItem[] = [
  {
    title: 'pricing.features.services',
    data: [
      {
        title: 'سرویس پروفایل شرکت‌ها',
        free: true,
        personal: true,
        company: true,
        organization: true,
        info: 'در این سرویس می توانید اطلاعات ثبتی شرکت ها(نظیر شناسه ملی، کداقتصادی، شماره ثبت، آدرس ثبتی و...)، اطلاعات مدیران، اعضای هیئت مدیره و بازرسین، راه های ارتباطی، دارندگان حق امضا، سهامداران بورسی، آگهی های روزنامه رسمی، مجوزها، برندها و علائم تجاری، قراردادها با نهادهای حاکمیتی، تغییرات سرمایه ثبتی، پرتفوی بورسی، ارز دریافتی، محصولات و خدمات و ظرفیت تولید شرکت ها و...مشاهده نمایید.',
      },
      {
        title: 'سرویس پروفایل افراد در شرکت‌ها',
        free: true,
        personal: true,
        company: true,
        organization: true,
        info: 'در این سرویس می توانید اطلاعات بیوگرافی اشخاص نظیر کدملی، راههای ارتباطی، شرکت های مرتبط، اگهی های رسمی و... را مشاهده نمایید.',
      },
      {
        title: 'سرویس جستجوی ساده',
        free: true,
        personal: true,
        company: true,
        organization: true,
      },
      {
        title: 'سرویس جستجوی پیشرفته',
        free: '3 نتیجه اول',
        personal: '3 نتیجه اول',
        company: true,
        organization: true,
        info: 'در این سرویس می توانید با استفاده از فیلترهای موجود جستجوی دقیقی در میان شرکت ها، اشخاص، محصولات، صنایع، آگهی های رسمی، مالکیت های فکری و... انجام دهید و نتایج را به صورت فهرستی حرفه ای و کارآمد مشاهده نمایید.',
      },
      {
        title: 'سرویس شبکه ارتباطات',
        free: false,
        personal: false,
        company: true,
        organization: true,
        info: 'در این سرویس می توانید ارتباط ثبتی شرکت با شرکت‌های دیگر، اشخاص با شرکت‌ها و اشخاص با اشخاص دیگر را در قالب یک نمودار مشاهده نمایید.',
      },
      {
        title: 'سرویس تحلیل صنعت',
        free: false,
        personal: false,
        company: true,
        organization: true,
        info: 'در این سرویس می توانید دسته بندی کالاها، آمار تجارت جهانی و تجارت ایران، شرکت های تولید کننده و واردکننده هر کالا بر اساس کد HS، و نیز ارزش‌گذاری کالاهای وارداتی براساس برند، مدل، کشور سازنده، ارزش ارزی آن و تعرفه‌های گمرکی و لیست و جزئیات کالاهای ثبت شده مربوطه در سامانه ایران کد را مشاهده نمایید.',
      },
    ],
  },
  {
    title: 'pricing.features.special',
    data: [
      {
        title: 'قابلیت دنبال کردن (فالو کردن)',
        free: false,
        personal: true,
        company: true,
        organization: true,
        info: 'اطلاع رسانی آخرین تغییرات مرتبط روزنامه رسمی در صفحه اصلی داشبورد و نیز بخش پیام ها، با دنبال کردن یک شرکت/شخص/شناسه ملی/کدملی/کدپستی/برند در قالب لیست‌های اختصاصی خود و یا به صورت مجزا',
      },
      {
        title: 'دریافت خروجی اکسل',
        free: false,
        personal: true,
        company: true,
        organization: true,
        info: 'امکان دریافت خروجی اکسل از اطلاعات صفحات شرکت‌ها، اشخاص و نتایج جستجوی پیشرفته نکته: در هر خروجی اکسل نتایج جستجوی پیشرفته محدودیت زیر برقرار است: اشتراک شرکتی: 500 رکورد | اشتراک سازمانی: 2000 رکورد',
      },
      {
        title: 'ذخیره‌ سازی نتایج جستجو',
        free: false,
        personal: false,
        company: true,
        organization: true,
        info: 'امکان ذخیره فیلترها و نتایج جستجوی پیشرفته',
      },
      {
        title: 'نمایش شرکت‌های مادر و زیرمجموعه',
        free: false,
        personal: false,
        company: true,
        organization: true,
        info: 'مشاهده شرکت های مادر و زیرمجموعه یک شرکت شرکت مادر: شرکتی که عضو هیات مدیره شرکت مورد نظر باشد شرکت زیر مجموعه: شرکتی که شرکت مورد نظر عضو هیات مدیره آن می‌باشد. ',
      },
      {
        title: 'دسترسی IP Range',
        free: false,
        personal: false,
        company: false,
        organization: true,
        info: 'محدود کردن دسترسی کارکنان سازمان به استفاده از رسمیو از داخل سازمان - ایجاد دسترسی کلی برای سازمان ',
      },
      {
        title: 'بک لینک فالو (follow)',
        free: false,
        personal: false,
        company: false,
        organization: true,
        info: 'ارجاع لینک برای سایت شما از سایت رسمیو به منظور افزایش رتبه و بهبود سئوی سایت شما',
      },
      {
        title: 'ایجاد دسترسی برای کلیه کارکنان سازمان',
        free: false,
        personal: false,
        company: false,
        organization: true,
        info: 'امکان دسترسی کلیه کارکنان سازمان بدون خرید اکانت به ازای هر نفر',
      },
    ],
  },
  {
    title: 'pricing.features.support',
    data: [
      {
        title: 'پشتیبانی و آموزش عادی',
        free: false,
        personal: true,
        company: true,
        organization: true,
        info: 'آموزش پایه و اولیه امکانات و سرویس‌های رسمیو به همراه پشتیبانی متنی و ایمیلی',
      },
      {
        title: 'پشتیبانی تصویری و شماره تماس اختصاصی',
        free: false,
        personal: false,
        company: false,
        organization: true,
        info: ' ارتباط تصویری و تماس بدون انتظار اختصاصی با پشتیبانی رسمیو',
      },
      {
        title: 'آموزش گروهی کارکنان به صورت حضوری یا مجازی',
        free: false,
        personal: false,
        company: false,
        organization: true,
        info: 'برگزاری جلسات حضوری یا مجازی در صورت درخواست برای آموزش کارکنان',
      },
    ],
  },
]

export const pricingFeatureItems: PricingFeatureItems = [
  {
    icon: <PricingCompanySvg />,
    title: 'پروفایل شرکت‌ها',
    description: 'پروفایل شرکت‌های ثبت شده در ایران با قابلیت جستجو',
    route: '/about-companies',
  },
  {
    icon: <PricingPersonSvg />,
    title: 'پروفایل اشخاص در شرکت‌ها',
    description: 'پروفایل افراد مدیریت کننده شرکت‌ها',
    route: '/about-persons',
  },
  {
    icon: <PricingIndustrySvg />,
    title: 'تحلیل صنعت',
    description: 'دسته‌بندی و تحلیل شرکت‌های وارد و تولید کننده',
    route: '/about-industry',
  },
  {
    icon: <PricingSearchSvg />,
    title: 'جستجوی پیشرفته',
    description: 'جستجوی پیشرفته در اطلاعات ثبتی کشور مانند برندها',
    route: '/about-advanced-search',
  },
  {
    icon: <PricingNetworkSvg />,
    title: 'شبکه ارتباطات',
    description: 'یافتن ارتباط بین افراد و شرکت‌ها در لایه‌های مدیریتی',
    route: '/about-graph',
  },
]

export const requestConsultantOptions = [
  { title: 'خرید اشتراک', value: 1 },
  { title: 'تمدید اشتراک', value: 2 },
  { title: 'ارتقا اشتراک', value: 3 },
  { title: 'درج تبلیغات در رسمیو', value: 4 },
  { title: 'API', value: 5 },
  { title: 'سایر', value: 6 },
]
